configuration/src/InformationRegisters/ШаблоныОписанияДляФилиалов/ШаблоныОписанияДляФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныОписанияДляФилиалов</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныОписанияДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/ШаблоныОписанияДокументов/ШаблоныОписанияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныОписанияДокументов</name>
  <owners>Catalog.Филиалы</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>CatalogRef.ТипыОбъектовВладельцев</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураОписания</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтильНаписания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/ШаблоныОписанияДляФилиалов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура Записать(Знач Филиал, Знач Шаблоны) Экспорт
	
	ДатаИзменения = ТекущаяДатаСеанса();
	Пользователь = ПараметрыСеанса.ТекущийПользователь;	

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Филиал.Установить(Филиал);

	Для Каждого Шаблон Из Шаблоны Цикл	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Филиал = Филиал;
		НоваяЗапись.Шаблон = Шаблон;
		НоваяЗапись.ДатаИзменения = ДатаИзменения;
		НоваяЗапись.Пользователь = Пользователь;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Функция - возврашает соответствие назначения и шаблона описания из настроек филиала пользователя
// 
// Возвращаемое значение:
//  Соответствие - назначение и шаблон описания
//
Функция ПолучитьШаблоныОписания() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныОписанияДокументов.ШаблонHTML КАК ШаблонHTML,
	|	ШаблоныОписанияДокументов.Назначение КАК Назначение
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Филиалы КАК Филиалы
	|		ПО Пользователи.Филиал = Филиалы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШаблоныОписанияДляФилиалов КАК ШаблоныОписанияДляФилиалов
	|		ПО (Филиалы.Ссылка = ШаблоныОписанияДляФилиалов.Филиал)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныОписанияДокументов КАК ШаблоныОписанияДокументов
	|		ПО (ШаблоныОписанияДляФилиалов.Шаблон = ШаблоныОписанияДокументов.Ссылка)
	|			И (ШаблоныОписанияДокументов.ТипОбъекта = ЗНАЧЕНИЕ(Справочник.ТипыОбъектовВладельцев.Документ_ЗаявкаНаРазработку))
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Назначение, Выборка.ШаблонHTML);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
